kanuba0814/NanoSoul/sdkconfig.defaults
# NanoSoul test 分支默认配置（目标由 idf.py set-target esp32p4 写入 sdkconfig）
CONFIG_IDF_TARGET="esp32p4"

# Flash 16MB（开发板板载 ≥16MB；整机固件 gfx+esp-dl+esp-sr+hosted 都要进 app）
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# 自定义分区（A/B OTA）
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 日志
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 主任务栈（点屏 + 起任务）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# —— PSRAM：MIPI-DSI 帧缓存 + LVGL 绘制缓冲在 PSRAM（与 Alpha 同，开发板实测可用）——
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# esp_lcd MIPI-DSI 需要
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# —— 相机 (esp_video MIPI-CSI): CSI ISR 走 cache-safe, 避免偶发 0x102 崩溃 ——
CONFIG_CAM_CTLR_MIPI_CSI_ISR_CACHE_SAFE=y

# —— 人脸检测模型: MSRMNP s8 v1, 放 human_face_det flash 分区 ——
CONFIG_HUMAN_FACE_DETECT_MODEL_IN_FLASH_PARTITION=y
CONFIG_FLASH_HUMAN_FACE_DETECT_MSRMNP_S8_V1=y
CONFIG_HUMAN_FACE_DETECT_MSRMNP_S8_V1=y

# —— LVGL ——
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_BUILTIN_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
